{"pageProps":{"title":"What is Web Speech Recognition?","description":"Are you a web developer interested in adding speech recognition to your web app? Learn what this technology is and how to use it here.","contentHtml":"<p>What is a \"voice-driven\" web app? It's a web app that can activate the microphone and turn the user's speech into text that it can process. That text can either be displayed to the user or interpreted as commands. That means controlling the web with nothing but your voice!</p>\n<p>How can a web developer build such a web app? There are two ways:</p>\n<ol>\n<li>Use the native support for speech recognition that's built in to some web browsers</li>\n<li>Connect their web app to a cloud platform that provides speech recognition services. For example: Speechly, AWS Transcribe, Azure Cognitive Services</li>\n</ol>\n<h2>Native speech recognition</h2>\n<p>Some browsers offer speech recognition JavaScript APIs out of the box. The dominant player in this area is Google Chrome, for two reasons:</p>\n<ol>\n<li>Google contributed heavily to the <a href=\"https://wicg.github.io/speech-api/#speechreco-section\">specification</a> for these APIs</li>\n<li>Google own a speech recognition platform (Google Cloud Speech-to-Text API) and are able to bake a client for this API into Chrome</li>\n</ol>\n<p>Other browsers are slowly catching up, notably <a href=\"https://firt.dev/ios-14.5/#speech-recognition-api\">Safari</a> which now offers a Siri-based equivalent.</p>\n<p>What is this JavaScript API for speech recognition? It's the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Speech_API/Using_the_Web_Speech_API\">Web Speech API</a>, an experimental browser standard that enables web developers to process voice input from their users. Its simple API can turn on the device's microphone and apply a speech-to-text algorithm to convert whatever the user says into text that the web app can process.</p>\n<h2>Cloud speech recognition</h2>\n<p>Although the Web Speech API offers a convenient way to start building voice features in your web app, it does have some limitations:</p>\n<ul>\n<li>Browser support is limited. On other browsers, voice features won't work natively and will need to be replaced by fallback features. This can result in a fragmented user experience across browsers. One <a href=\"https://github.com/brave/brave-browser/issues/3725#issuecomment-555733958\">example</a> is Duolingo, which only offers its voice exercises on Chrome</li>\n<li>Across the browsers that do support it, implementations are different:\n<ul>\n<li>Words may be transcribed correctly by some browsers but not by others</li>\n<li>Words may be transcribed incorrectly in different ways</li>\n<li>Words may be formatted differently</li>\n<li>Implementations across browsers are upgraded in a different cadence and something that worked previously in one browser might not work in the next upgrade</li>\n</ul>\n</li>\n</ul>\n<p>So what is the alternative? How can we make a voice-driven web app that works consistently across <em>all</em> browsers? The answer is to pick your favourite cloud vendor and use whatever speech recognition service they offer. That means you will need a web client that can do the following:</p>\n<ol>\n<li>Get audio from the microphone</li>\n<li>Stream that audio to the service</li>\n<li>Process the transcription stream that comes back</li>\n</ol>\n<p>Building this yourself can be tricky, so you may want to use a web client written by the cloud vendor (if they have one!) or use a polyfill for the Web Speech API. What's a polyfill though?</p>\n<h2>Polyfills</h2>\n<p>A <a href=\"https://developer.mozilla.org/en-US/docs/Glossary/Polyfill\">polyfill</a> is a piece of code that implements missing browser functionality. The Web Speech API doesn't exist on many browsers, so there are polyfills that fill in that gap, using a specific cloud vendor to provide the speech recognition under the hood. The polyfill API itself will more or less meet the <a href=\"https://wicg.github.io/speech-api/#speechreco-section\">specification</a>. This means that polyfills can easily be swapped out with either the native implementation on browsers that support the API natively, or with polyfills for other vendors if you choose to switch.</p>\n<p>There are currently polyfills for two cloud vendors: <a href=\"https://github.com/speechly/speech-recognition-polyfill\">Speechly</a> and <a href=\"https://github.com/compulim/web-speech-cognitive-services\">Azure Cognitive Services</a>. One for Amazon Web Services is on its way!</p>\n<h2>Building React apps with speech recognition</h2>\n<p>How can you integrate speech recognition in your web app? If you're a React developer, this is easy and doesn't require you to build any speech recognition client or know how to use the Web Speech API. The most popular solution is a package called <a href=\"https://github.com/JamesBrill/react-speech-recognition\">react-speech-recognition</a>. This is a React hook that passes transcripts from the microphone into your React app, and allows you to specify voice commands. It is compatible with any implementation of the Web Speech API, meaning you just need to plug in the polyfill for your chosen cloud vendor and it will work consistently across all browsers. It also works with native implementations (e.g. Chrome) out of the box and tells your React app when the browser doesn't support the API natively. This is handy for building prototypes without needing to set up a cloud vendor account.</p>\n<p>You can get started with a basic example <a href=\"https://github.com/JamesBrill/react-speech-recognition#basic-example\">here</a>.</p>\n<h2>What's next?</h2>\n<p>Web speech recognition still has a young ecosystem, with some notable gaps:</p>\n<ul>\n<li>Lack of browser support</li>\n<li>Limited selection of polyfills</li>\n<li>Limited support for other web frameworks such as Vue</li>\n</ul>\n<p>The goal of this website is to educate web developers about web speech recognition and encourage them to fill these gaps. The easier it is to build voice-driven web apps, the more that will get built and be of higher quality. This will improve the technology and best practices in this area, ultimately leading to better user experiences!</p>\n"},"__N_SSG":true}